Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputValidationEventArgs
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputValidationEventArgs class provides the event argument for pick ending events.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Picking.InputValidationEventArgs.ContinueSession
Gets or sets a value indicating whether the picking session should continue even though the picking is
done.
Remarks:
The effect of this flag (forcing the continuation of the picking session) is only valid if the picking
session is not interrupted, i.e. the session is finishing by a request from the user, and not by an
interrupt event.